Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: - Run the command ``./cli`` or ``php cli``
ja: - ``./cli`` or ``php cli`` のコマンドを実行する

source: figure:: /_static/tags-search.png :alt: Search Tags
ja: figure:: /_static/tags-search.png :alt: タグで検索

source: In this way, you can use Kanboard to manage external tasks in the same way as native tasks.
ja: この方法では、Kanboardを内部タスクと同様に外部タスクを管理するのに使用できます。

source: Create an empty database with the command ``pgsql``: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: ``pgsql`` コマンドで空のデータベースを作成する: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Why do you close inactive issues automatically?
ja: 活発でないissueを自動で閉じるのはなぜですか？

source: Follow these instructions: `<https://github.com/kanboard/website#how-to-add-a-new-plugin-to-the-list>`_
ja: `<https://github.com/kanboard/website#how-to-add-a-new-plugin-to-the-list>`_ のインストラクションに従ってください。

source: - Stale issues create more noise.
ja: - 古いissueを作る事はノイズ以上に不都合です。

source: - Have a valid email address in their profile
ja: - 有効なメールアドレスをプロフィールに登録する

source: - LDAP group providers is enabled
ja: - LDAP グループプロバイダを有効にする

source: Kanboard installation ~~~~~~~~~~~~~~~~~~~~~
ja: Kanboard のインストール ~~~~~~~~~~~~~~~~~~~~~

source: - **username** Must be unique (string, required)
ja: - **username** ユニークでなければなりません (string, 必須)

source: --no-ansi Disable ANSI output
ja: --no-ansi ANSI形式での出力を無効化

source: This command send a “daily cronjob event” to all open tasks of each project.
ja: このコマンドは、"daily cronjob event"を個々のプロジェクトの未完了タスクに送ります。

source: There are different kinds of restrictions:
ja: これらは違う種類の制限です:

source: Example: ``completedRange:2018/01/21..2018/01/31`` or ``completedRange:"2018-01-21..2018-01-31"``
ja: 例: ``completedRange:2018/01/21..2018/01/31`` か ``completedRange:"2018-01-21..2018-01-31"``

source: // TOTP (2FA) issuer name define('TOTP_ISSUER', 'Kanboard');
ja: // TOTP (二要素認証) のissuer name define('TOTP_ISSUER', 'Kanboard');

source: Notifications =============
ja: 通知 =============

source: The only required method is ``initialize()``.
ja: 必要なメソッドは ``initialize()`` だけです。

source: - Assign the task to a specific user
ja: - タスクの担当者を割当てる

source: - The default Database method implements ``PasswordAuthenticationProviderInterface`` and ``SessionCheckProviderInterface``
ja: - -デフォルトのデータベースのメソッドの実装は ``PasswordAuthenticationProviderInterface`` と ``SessionCheckProviderInterface`` です。

source: // Lock the account after 6 authentication failure
ja: // 6回認証に失敗した後はアカウントをロックする

source: A new secret key is generated each time you enable/disable this feature.
ja: この機能の有効/無効を切り替える都度、新しい秘密鍵が生成されます。

source: Project Search --------------
ja: プロジェクト検索 --------------

source: Example to attach a template with a callable:
ja: テンプレートにcallableを付ける例:

source: You can test with the `embedded web server of PHP <http://www.php.net/manual/en/features.commandline.webserver.php>`__:
ja: `PHPに組み込まれたweb サーバー <http://www.php.net/manual/en/features.commandline.webserver.php>`__ によってテストできます:

source: - Result on success: **mixed**
ja: - 成功時の返り値: **混合**

source: - **username**: This is the unique identifier of your user (login)
ja: - **ユーザー名**: これはユーザー(のログイン時)の識別のためにユニークな物です。

source: - Purpose: **Get projects of connected user with full details**
ja: - 用途: **接続しているユーザーでプロジェクトを完全な詳細付きで取得する**

source: - Purpose: **Add a new swimlane**
ja: - 用途: **新しいスイムレーンを追加する**

source: figure:: /_static/project-permissions.png :alt: Project Permissions
ja: figure:: /_static/project-permissions.png :alt: プロジェクトの権限

source: - Each time a subtask is in progress, the timer is also started.
ja: - サブタスクを進行中にする都度、タイマーも開始されます。

source: - PHP LDAP extension enabled
ja: - PHP LDAP 拡張が有効であること

source: - `PHP for Windows is available here <http://windows.php.net/download/>`__
ja: - `PHP for Windows はここから入手できます <http://windows.php.net/download/>`__

source: In the method ``initialize()`` of your plugin register your custom backend like that:
ja: ``initialize()`` メソッドはカスタムバックエンド同様、以下の要領でプラグインを登録します:

source: - Purpose: **Get all files attached to a project**
ja: - 用途: **プロジェクトに添付された全てのファイルを取得する**

source: Dependency Injection Container ------------------------------
ja: DIコンテナ ------------------------------

source: The only method you need to implement is ``sendEmail()``:
ja: 実装しなければならないメソッドは ``sendEmail()`` だけです:

source: - Any ticketing system (bug tracker, customer support ticket…)
ja: - 他のチケットシステム (バグトラッカー, カスタマーサポート用チケット…)

source: Apache Installation ~~~~~~~~~~~~~~~~~~~
ja: Apache のインストール ~~~~~~~~~~~~~~~~~~~

source: // By default, require certificate to be verified for ldaps:// style URL.
ja: // デフォルトでは、 ldaps:// 様式のURLには検証が必要です

source: // Mysql parameters define('DB_USERNAME', 'REPLACE_ME'); define('DB_PASSWORD', 'REPLACE_ME'); define('DB_HOSTNAME', 'REPLACE_ME'); define('DB_NAME', 'kanboard');
ja: // SQLサーバーのパラメータ define('DB_USERNAME', 'REPLACE_ME'); define('DB_PASSWORD', 'REPLACE_ME'); define('DB_HOSTNAME', 'REPLACE_ME'); define('DB_NAME', 'kanboard');

source: The authentication is done by another system, Kanboard doesn’t know your password and suppose you are already authenticated.
ja: この認証は別のシステムで完了するので、Kanboardはパスワードを知らず、あなたも既に認証されていると思うでしょう。

source: JSON-RPC is a remote procedure call protocol encoded in JSON.
ja: JSON-RPC は JSON でエンコードされる遠隔手続呼び出しのプロトコルです。

source: - ``KANBOARD\\%s`` will be replaced by ``KANBOARD\my_user``
ja: - ``KANBOARD\\%s`` は、 ``KANBOARD\my_user`` に置き換えられます

source: How to write a web hook receiver?
ja: Webhookのレシーバーを書くには？

source: Interfaces ----------
ja: インターフェース ----------

source: Possible solutions:
ja: 利用できる対処法:

source: For example ``:my_variable`` declare a new variable named ``my_variable``.
ja: 例えば、 ``:my_variable`` は新しい変数``my_variable`` の宣言です。

source: - Result on failure: **Default timezone** (UTC)
ja: - 失敗時の返り値: **デフォルトのタイムゾーン** (UTC)

source: All tasks, projects and users are stored inside this database.
ja: 全てのタスク、プロジェクト、そしてユーザー情報はこのデータベース内に保存されます。

source: figure:: /_static/task-time-tracking.png :alt: Task time tracking
ja: figure:: /_static/task-time-tracking.png :alt: タスクの時間追跡

source: Setting up Kanboard ~~~~~~~~~~~~~~~~~~~
ja: Kanboard の設定 ~~~~~~~~~~~~~~~~~~~

source: - The recommended database is Postgresql.
ja: - 推奨するデータベースはPostgresqlです。

source: From the **users** menu, click on the link **remove**.
ja: **ユーザー管理** メニューから、 **削除** のリンクをクリックしてください。

source: Usually that requires no configuration if your server can already send emails.
ja: 既にサーバーがEmailを送れるように設定済みの場合、それ以上の設定が必要ありません。

source: *Note*: If you want to use additional features like LDAP integration etc. please install proper PHP module from ``lang/php5-extensions``.
ja: *注意*:もしLDAP統合のような外部の機能を使用する場合、それに応じたPHPモジュールを ``lang/php5-extensions`` からインストールしてください。

source: - The PHP extension ``pdo_pgsql`` installed (Debian/Ubuntu: ``apt-get install php5-pgsql``)
ja: - - PHP 拡張 ``pdo_pgsql`` がインストールされている (Debian/Ubuntu:``apt-get install php5-pgsql``)

source: - Purpose: **Create a new tag**
ja: - 用途: **新しいタグを作成**

source: export:daily-project-column-stats Daily project column stats CSV export (number of tasks per column and per day)
ja: export:daily-project-column-stats 毎日のプロジェクトのカラムの統計をCSVでエクスポート (1日でのカラム毎のタスク数)

source: - **Category**: Only one category can be assigned to a task (visible only if the projects have categories).
ja: - **カテゴリ**: 1つのタスクには、一つのカテゴリのみを割り当てることができます(プロジェクトにカテゴリがある場合のみ表示)。

source: - Do something in Kanboard (drag and drop a task for example)
ja: - Kanboard上で何かをする (例としてタスクをドラッグアンドドロップする)

source: Each file contains all migrations, here an example for Sqlite:
ja: 個々のファイルはマイグレーションの全てを含んでいます。ここにSqliteの例を示します:

source: User LDIF example:
ja: User LDIF の例:

source: Manual installation -------------------
ja: 手動でのインストール -------------------

source: Once the order is validated, swap it to the “Production” project.
ja: 一旦受注を確認してから、"生産" プロジェクトに移します。

source: The file ``Plugin.php`` is used to load and register the plugin.
ja: ``Plugin.php`` ファイルはプラグインのロードと登録に使用されます。

source: - Switch to the project overview = **v o**
ja: - プロジェクト概要に切り替え = **v o**

source: Helper skeleton:
ja: ヘルパーの概略:

source: or
ja: もしくは

source: - Parameters: **project_id** (integer, required)
ja: - Parameters: **project_id** (integer, 必須)

source: - User: Notifications sent individually and configured at the user profile
ja: - ユーザー: ユーザープロフィールで、通知を送るよう個別に設定

source: // LDAP attribute to find groups in user profile define('LDAP_USER_ATTRIBUTE_GROUPS', 'memberof');
ja: // LDAP 属性でユーザーのプロフィールからグループを見つける define('LDAP_USER_ATTRIBUTE_GROUPS', 'memberof');

source: For proper usage see `this link <http://spring.io/guides/gs/consuming-rest>`__.
ja: 正確な使用方法は `このリンク <http://spring.io/guides/gs/consuming-rest>`__ を参照願います。

source: - Result on success: **dictionary of metadata**
ja: - 成功時の返り値: **メタデータの連想配列**

source: Performances ============
ja: パフォーマンス ============

source: +------------+---------------------------------------------------------------+ | Type | Description | +============+===============================================================+ | Proxy User | A specific user is used to browse LDAP directory | +------------+---------------------------------------------------------------+ | User | The end-user credentials are used for browsing LDAP directory | +------------+---------------------------------------------------------------+ | Anonymous | No authentication is performed for LDAP browsing | +------------+---------------------------------------------------------------+
ja: +-----------+----------------------------------------------------------+ | タイプ | 概要 | +===========+==========================================================+ | ローカル | Kanboardのデータベースにパスワードが保存されるユーザー | | ユーザー | | +-----------+----------------------------------------------------------+ | リモート | 別のシステムによって管理されるユーザー | | ユーザー | 例:LDAP サーバー) | +-----------+----------------------------------------------------------+

source: Go to the task view and choose **Duplicate to another project**.
ja: タスクビューを開いてから、**別プロジェクトに複製** を選択してください。

source: This is not in the scope of this documentation.
ja: この件はこの文書のスコープ外です。

source: // Set to false to allow self-signed certificates define('HTTP_VERIFY_SSL_CERTIFICATE', true);
ja: // falseにすると、自己署名証明書を許容する define('HTTP_VERIFY_SSL_CERTIFICATE', true);

source: - Create a new repository
ja: - 新しくリポジトリを作成する

source: - OAuth2 authentication
ja: - OAuth2 認証

source: - Result on success: **Group dictionary**
ja: - 成功時の返り値: **グループの連想配列**

source: - Purpose: **Check if a user is active**
ja: - 用途: **ユーザーが有効かどうか確認する**

source: Allow people to move tasks only between specific columns ''''''''''''''''''''''''''''''''''''''''''''''''''''''''
ja: 特定のカラム間でのみタスクの移動を許可する ''''''''''''''''''''''''''''''''''''''''''''''''''''''''

source: Example to query the LDAP directory:
ja: LDAP ディレクトリへのクエリの例:

source: Search events by task status ~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: タスクの状況でイベントを検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: figure:: /_static/example-restriction-task-status-blocked.png :alt: Example column restriction
ja: figure:: /_static/example-restriction-task-status-blocked.png :alt: カラムの制限の例

source: figure:: /_static/board-compact-mode.png :alt: Switch to compact mode
ja: figure:: /_static/board-compact-mode.png :alt: コンパクトモードに切替

source: - You can drag and drop tasks between swimlanes.
ja: - スイムレーン間でタスクをドラッグアンドドロップ出来ます。

source: - No one manages projects in the same way, this is not possible to satisfy the workflow of everyone.
ja: - 同様にプロジェクトを管理している人も居ないので、全員を満足させるワークフローは不可能です。

source: This information might be cached by the plugin to improve the loading time.
ja: この情報は読み込み時間の改善のためにプラグインによってキャッシュされる場合があります。

source: - Drag and drop restrictions
ja: - ドラッグアンドドロップの制限

source: If you use Kanboard with Apache and with the mode rewrite enabled, nice URLs will be used automatically.
ja: KanboardをApache上で使用していて、rewriteモードが有効な場合、自動的に分かりやすいURLを使用します。

source: - Firefox (optional)
ja: - Firefox (任意)

source: - Find tasks by link name: ``link:"is a milestone of"``
ja: - リンク名で検索: ``link:"is a milestone of"``

source: Check if the directory ``data`` is writeable by the web server user 4.
ja: ``data`` ディレクトリがwebサーバーのユーザーが書き込み出来ることを確認してください。

source: Choose an action 2.
ja: アクションを選択する 2.

source: You can attach metadata for each project, task, user or for the whole application.
ja: 個々のプロジェクト、タスク、ユーザー、あるいはアプリケーション全体にメタデータを添付できます。

source: From there, you can create groups and assign users.
ja: ここから、グループの作成とユーザーの割り当てができます。

source: define('PLUGIN_INSTALLER', false); // Default is false since Kanboard v1.2.8
ja: define('PLUGIN_INSTALLER', false); // Kanboard v1.2.8 から、デフォルトはfalseです。

source: - Purpose: **Get all members of a group**
ja: - 用途: **グループの全てのメンバーを取得する**

source: For this workaround to work, add these lines to your ``.htaccess`` file:
ja: この周りを動かすには、下記の行を ``.htaccess`` に追加してください:

source: - Kanban doesn’t impose strict constraints or meetings; the process is more flexible
ja: - かんばんは厳格な制約を課さず、ミーティングもしない: プロセスには柔軟性がある(訳注:元ネタでも順序の指示には別の方法を併用する)

source: Each individual team project can assign a different role to each user and group:
ja: 個々のチームプロジェクト毎に各々のユーザーとグループに違う役割を割り当てることができます :

source: Another example with Kanboard in a subfolder:
ja: Kanboardがサブフォルダに入っているときの例:

source: Navigate to the PHP folder and rename the file ``php.ini-production`` to ``php.ini``
ja: PHPフォルダに移動して、``php.ini-production`` ファイルを ``php.ini`` にリネームする

source: Here an example to register your own models in the container:
ja: ここにコンテナ内のモデルを登録する例を示します:

source: - Only for tasks created by you
ja: - 自分が作成したタスクのみ

source: There is actually no way to restore the database from the user interface.
ja: ユーザーインターフェースからデータベースを復元する方法は全くありません。

source: In case you get a “404 Not Found”, you might need to set at least the following overrides for your DocumentRoot to get the .htaccess files working:
ja: “404 Not Found”を返された場合、少なくとも DocumentRootへ.httaccessファイルが効くように、以下のようにオーバーライドする必要があります。

source: figure:: /_static/project-settings.png :alt: Project settings
ja: figure:: /_static/project-settings.png :alt: プロジェクト設定

source: // Enable or disable "Strict-Transport-Security" HTTP header define('ENABLE_HSTS', true);
ja: // "Strict-Transport-Security" HTTP ヘッダの有効化/無効化 define('ENABLE_HSTS', true);

source: - If you are a regular user, you can change only your own profile
ja: - 一般ユーザーは、自分のプロフィールを編集することのみできます。

source: - Purpose: **Disable a project**
ja: - 用途: **プロジェクトを無効化する**

source: - Purpose: **Create a new group**
ja: - 用途: **グループの新規作成**

source: Options:
ja: オプション:

source: To add a new method, you can do something like this from your plugin:
ja: 以下の要領で、あなたのプラグインから新しいメソッドを追加できます。

source: Install mod_php for Apache:
ja: mod_php for Apache をインストールする:

source: The brute force protection of Kanboard works at the user account level:
ja: Kanboardの総当たり攻撃からの保護はユーザーアカウントのレベルで働きます:

source: --ansi Force ANSI output
ja: --ansi ANSI形式での出力を強制する

source: - The data are encoded in JSON format and sent with a POST HTTP request
ja: - データはJSON形式でエンコードされ、HTTPのPOSTリクエストで送られます。

source: This calendar shows only tasks assigned to the user and optionally sub-tasks information.
ja: このカレンダーはユーザーに割当てられたタスクと、追加的なサブタスクの情報のみを表示します。

source: Example of authentication plugins ---------------------------------
ja: 認証プラグインの例 ---------------------------------

source: - Result on success: **list of tasks**
ja: - 成功時の返り値: **タスクのリスト**

source: Usually, running the cronjob under the web server user is enough.
ja: 通常、webサーバーのユーザーでcronjobを実行すれば十分です。

source: This method must return an object that implements the interface ``Kanboard\Core\User\UserProviderInterface``.
ja: このメソッドは ``Kanboard\Core\User\UserProviderInterface`` として実装されているインターフェースにオブジェクトを返す必要があります。

source: - The combination of the 2 rules is important, otherwise that will not work.
ja: - これは、2つのルールを組み合わせることが重要で、そうでなければうまく動かないでしょう。

source: End user help and documentation.
ja: エンドユーザー用のヘルプと文書です.

source: - There is a subdirectory for each language, for example in French we have ``fr_FR``, Italian ``it_IT`` etc.
ja: - この中にはフランス語なら ``fr_FR``、イタリア語なら ``it_IT`` といったように、言語ごとのサブディレクトリがあります。

source: # Get the last development version git clone https://github.com/kanboard/kanboard.git cd kanboard
ja: # 最新の開発版を入手する git clone https://github.com/kanboard/kanboard.git cd kanboard

source: Reset user password ~~~~~~~~~~~~~~~~~~~
ja: ユーザーのパスワードを変更する ~~~~~~~~~~~~~~~~~~~

source: figure:: /_static/task-timesheet.png :alt: Task timesheet
ja: figure:: /_static/task-timesheet.png :alt: タスクのタイムシート

source: Lead and Cycle Time ~~~~~~~~~~~~~~~~~~~
ja: リードタイム・サイクルタイム ~~~~~~~~~~~~~~~~~~~

source: Project access must be allowed by the project owner.
ja: プロジェクトへのアクセスは、プロジェクト所有者から許可を受けなければなりません。

source: - **is a parent of** \| is a child of
ja: - **次の親タスクです** \| 次に重複しています

source: figure:: /_static/tags-task.png :alt: Tags form
ja: figure:: /_static/tags-task.png :alt: タグ入力フォーム

source: // SMTP configuration to use when the "smtp" transport is chosen define('MAIL_SMTP_HOSTNAME', ''); define('MAIL_SMTP_PORT', 25); define('MAIL_SMTP_USERNAME', ''); define('MAIL_SMTP_PASSWORD', ''); define('MAIL_SMTP_ENCRYPTION', null); // Valid values are "null", "ssl" or "tls"
ja: // "smtp" での送信を選んだときに使用するSMTPの設定 define('MAIL_SMTP_HOSTNAME', ''); define('MAIL_SMTP_PORT', 25); define('MAIL_SMTP_USERNAME', ''); define('MAIL_SMTP_PASSWORD', ''); define('MAIL_SMTP_ENCRYPTION', null); // Valid values are "null", "ssl" or "tls"

source: - People member of “Kanboard Managers” will have the role “Managers”
ja: - “Kanboard Managers” のメンバーは “プロジェクト管理者” の役割を持ちます

source: You can also define a custom location for the plugins and files folders by changing the config file.
ja: また、設定ファイルを変更することで、プラグインとファイルのフォルダの場所を変更することもできます。

source: Kanboard will use the external id to sync with the local database.
ja: Kanboard は外部IDをローカルのデータベースと同期するのに使用するでしょう。

source: Subtasks also have the fields “time spent” and “time estimated”.
ja: サブタスクもまた、 **経過時間** と **見積時間** のフィールドを持ちます。

source: - Purpose: **Get Project metadata**
ja: - 用途: **プロジェクトのメタデータを取得**

source: Limitations -----------
ja: 制限事項 -----------

source: - Purpose: **Get Activityfeed for Project(s)**
ja: - 用途: **(複数の)プロジェクトのフィードを取得する**

source: - Result on failure: **empty string**
ja: - 失敗時の返り値: **空の文字列**

source: - Otherwise: ``?controller=board&action=show&project_id=123``
ja: - それ以外: ``?controller=board&action=show&project_id=123``

source: There are many software compatible with the standard TOTP system.
ja: これは標準的なTOTPシステムの多くと互換性があります。

source: version=1.2.24
ja: version=1.2.24 (訳注:翻訳時の最新版はv1.2.15)

source: - Purpose: **Remove a comment**
ja: - 用途: **コメントの削除**

source: The only requirement is to implement the interfaces, you class can be written the way you want and located anywhere on the disk.
ja: インターフェースを実装することのみが必要で、あなたはクラスをどのようにも書くことが出来て、またディスク上のどこにでも置くことができます。

source: define('MAIL_SMTP_ENCRYPTION', null); // Valid values are "null", "ssl" or "tls"
ja: define('MAIL_SMTP_ENCRYPTION', 'ssl'); // "null", "ssl", "tls" が利用できます

source: - `Russian <https://github.com/kanboard/documentation-ru>`_
ja: - `ロシア語 <https://github.com/kanboard/documentation-ru>`_

source: Your plugin must implement the interface ``Kanboard\Core\Mail\ClientInterface`` and extends from ``Kanboard\Core\Base``.
ja: あなたのプラグインは ``Kanboard\Core\Mail\ClientInterface`` インターフェースで実装し、また ``Kanboard\Core\Base`` から拡張しなければなりません。

source: This method must return a list of ``GroupProviderInterface``, this is the result of the search.
ja: このメソッドは検索結果を``GroupProviderInterface``のリストで返す必要があります。

source: To avoid any potential timeout you can initialize the database directly by importing the SQL schema:
ja: いかなるタイムアウトの可能性も排除するため、SQLスキーマをインポートすることでデータベースの初期化を行うことができます:

source: - Purpose: **Get the a swimlane by name**
ja: - Purpose: **スイムレーンを名前から取得する**

source: Each language has its own repository:
ja: 個々の言語ごとにリポジトリを持っています:

source: - Since Kanboard > v1.1.0, the tag "stable" is not used anymore
ja: - Kanboard v1.1.0 以降では "stable" タグは使用されていません。

source: For the category container:
ja: カテゴリコンテナでは:

source: Only administrators can change those settings.
ja: これらの設定はシステム管理者のみが可能です。

source: - If enabled, when a subtask status is changed to “in progress”, the timer will start automatically.
ja: - 有効にすると、サブタスクの状態が"進行中"に変わった時、タイマーが自動的にスタートします。

source: Search by category ~~~~~~~~~~~~~~~~~~
ja: カテゴリで検索 ~~~~~~~~~~~~~~~~~~

source: Search by completion ~~~~~~~~~~~~~~~~~~~~
ja: 完了日で検索 ~~~~~~~~~~~~~~~~~~~~

source: Kanboard Configuration:
ja: Kanboard の設定:

source: - Purpose: **Update a task**
ja: - Purpose: **タスクのアップデート**

source: An example of a plugin directory structure:
ja: プラグインディレクトリの構造の例:

source: Install Cookiecutter:
ja: Cookiecutter をインストールする:

source: User's Guide ============
ja: ユーザー用ガイド ============

source: - Job offers
ja: - 求人

source: Upgrade all plugins ~~~~~~~~~~~~~~~~~~~
ja: プラグインを更新する ~~~~~~~~~~~~~~~~~~~

source: Local disk storage on Heroku is ephemeral:
ja: Heroku上のローカルディスクストレージは一時的なものです:

source: **We focus on simplicity**, we don’t want to have a bloated software.
ja: 我々は**単純化に焦点を当てており**、ソフトウェアの肥大化を望みません。

source: // LDAP attribute for user email define('LDAP_USER_ATTRIBUTE_EMAIL', 'mail');
ja: // LDAP 属性のユーザーのemailアドレス define('LDAP_USER_ATTRIBUTE_EMAIL', 'mail');

source: - Best performances are obtained with the latest version of PHP with OpCode caching activated.
ja: - 最良のパフォーマンスを得るために、OpCode キャッシュが有効化された最新のPHPを使用する。

source: IIS Configuration Example -------------------------
ja: IIS での設定例 -------------------------

source: This array will be merged with the default one.
ja: この配列は最初の配列にマージされます。

source: Search by modification date with range ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 変更日を範囲検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Continuous flow
ja: - 連続的な流れ

source: You must load the translations yourself when the session is created:
ja: セッションが生成された時に、自身で翻訳をロードしなければなりません:

source: Set the value 0 to disable this feature, 2 days by default (172800 seconds).
ja: デフォルトでは2日(172800秒)ですが、値を0にすると無効になります。

source: - Plugins installation from the web user interface is disabled by default.
ja: - WebUIからのプラグインのインストールはデフォルトで無効にされています。

source: - Purpose: **Create a link between two tasks**
ja: - 用途: **2つのタスク間のリンクを作成する**

source: - Purpose: **Change role of a group for a project**
ja: - 用途: **プロジェクトでのグループの役割を変更する**

source: To change the user photo, the previous one have to be removed manually in the user profile.
ja: ユーザーの写真を変更するには、ユーザープロフィールから以前の画像を手動で削除してください。

source: // Log filename if the log driver is "file"
ja: // ログドライバを "file" にした場合のログファイル名

source: - Tasks created by John Doe: ``creator:"John Doe"``
ja: - John Doeが作成したタスク: ``creator:"John Doe"``

source: - Each function is a migration
ja: - 個々の関数はマイグレーションのものです。

source: figure:: /_static/task-duplication-another-project.png :alt: Task Duplication Another Project
ja: figure:: /_static/task-duplication-another-project.png :alt: 別のプロジェクトにタスクを複製

source: - The user mentions works only during tasks and comments creation.
ja: - ユーザーの言及は、タスクとコメントの作成時のみ機能します。

source: Why did you close my question on the bug tracker?
ja: なぜバグトラッカー上の私の質問を閉じますか？

source: - With this view, you can drag and drop tasks between columns easily.
ja: - このビューでは、簡単にタスクをコラム間でドラッグアンドドロップできます。

source: Configuration on Unix and Linux platforms -----------------------------------------
ja: Unix・Linuxプラットフォーム上での設定 -----------------------------------------

source: You can search in tasks, comments, subtasks, links but also in the activity stream.
ja: タスク、コメント、サブタスク、リンク、また活動状況の流れも検索できます。

source: figure:: /_static/thunderbird-new-calendar-step2.png :alt: Thunderbird Step 2
ja: figure:: /_static/thunderbird-new-calendar-step2.png :alt: Thunderbird (ステップ 2)

source: Troubleshooting ---------------
ja: トラブルシューティング ---------------

source: - SQL migrations are executed automatically when you upgrade Kanboard to a new version
ja: - Kanboardをアップグレードした時、SQLのマイグレーションは自動的に実行されます。
